test/artillery/biddingResolver.yml
config:
  target: "https://wypcpelqdbhlxgrexisgez7vba.appsync-api.ap-northeast-2.amazonaws.com"
  phases:
    - duration: 1
      arrivalRate: 30
      name: test

scenarios:
  - name: "getMyBidding"
    flow:
      - post:
          url: "/graphql"
          headers:
            Authorization: bearer test testbidit
            Content-Type: application/json
          json:
            query: "{getMyBidding {id, itemId, user {id}, item {id}}}"